apigee/proxies/SOAP-Apigee-DEMO-2/apiproxy/policies/say_hello-build-soap.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<AssignMessage async="false" continueOnError="true" enabled="true" name="say_hello-build-soap">
    <DisplayName>say_hello Build SOAP</DisplayName>
    <Add>
        <Headers>
            <Header name="SOAPAction">say_hello</Header>
        </Headers>
    </Add>
    <Set>
        <Headers>
            <Header name="Content-Type">text/xml; charset=utf-8</Header>
        </Headers>
        <Payload contentType="text/xml">
<s11:Envelope xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/">  <s11:Body>    <ns1:say_hello xmlns:ns1="spyne.examples.hello.soap">      <ns1:name>{name}</ns1:name>      <ns1:times>{times}</ns1:times>    </ns1:say_hello>  </s11:Body>
</s11:Envelope>
</Payload>
        <Verb>POST</Verb>
    </Set>
    <AssignVariable>
        <Name>forward.target.url</Name>
        <Value>http://10.164.0.2:31197/</Value>
    </AssignVariable>
    <IgnoreUnresolvedVariables>true</IgnoreUnresolvedVariables>
    <AssignTo createNew="false" transport="http" type="request"/>
</AssignMessage>
